DocumentJournals/Банк.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DocumentJournal>
		<Properties>
			<Name>Банк</Name>
			<RegisteredDocuments>
				<xr:Item>Document.ВКД_ПлатежноеПоручениеВходящее</xr:Item>
				<xr:Item>Document.ВКД_ПлатежноеПоручениеИсходящее</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Контрагент</Name>
					<References>
						<xr:Item>Document.ВКД_ПлатежноеПоручениеВходящее.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.ВКД_ПлатежноеПоручениеИсходящее.Attribute.Контрагент</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Валюта</Name>
					<References>
						<xr:Item>Document.ВКД_ПлатежноеПоручениеИсходящее.Attribute.Валюта</xr:Item>
						<xr:Item>Document.ВКД_ПлатежноеПоручениеВходящее.Attribute.Валюта</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Сумма</Name>
					<References>
						<xr:Item>Document.ВКД_ПлатежноеПоручениеИсходящее.Attribute.Сумма</xr:Item>
						<xr:Item>Document.ВКД_ПлатежноеПоручениеВходящее.Attribute.Сумма</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Примечание</Name>
					<References>
						<xr:Item>Document.ВКД_ПлатежноеПоручениеВходящее.Attribute.Примечание</xr:Item>
						<xr:Item>Document.ВКД_ПлатежноеПоручениеИсходящее.Attribute.Примечание</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Статья</Name>
					<References>
						<xr:Item>Document.ВКД_ПлатежноеПоручениеВходящее.Attribute.Статья</xr:Item>
						<xr:Item>Document.ВКД_ПлатежноеПоручениеИсходящее.Attribute.Статья</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

AccumulationRegisters/ВКД_ПоступлениеСписаниеДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ВКД_ПоступлениеСписаниеДС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВКД_ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ВКД_ПлатежноеПоручениеИсходящее</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

DocumentJournals/Банк/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
ОстаткиДС = СтрокаОстатков();

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
ОстаткиДС = СтрокаОстатков();

КонецПроцедуры

&НаСервереБезКонтекста
Функция СтрокаОстатков()
		
	Табл = РегистрыНакопления.ВКД_ПоступлениеСписаниеДС.Остатки(,,"Валюта","Сумма");
	Если Табл.Количество() = 0 Тогда Возврат "" КонецЕсли; 
	
	Рез = "";
	Для Каждого стрТабл Из Табл Цикл
		гоРезСоо(Рез, гоСуммаЗнВал(стрТабл.Сумма, стрТабл.Валюта, 2), ",   ");
	КонецЦикла; 
	
	Возврат Рез;
	
КонецФункции


&НаКлиенте
Процедура Подробно(Команда)
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("СформироватьПриОткрытии",Истина);
	ОткрытьФорму("Отчет.ВКД_ОстаткиПоБанку.Форма",ПараметрыФормы, ЭтаФорма, Новый УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры
